ИС_СПОРТ_2022/src/Documents/ПрисвоениеРазряда/ПрисвоениеРазряда.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПрисвоениеРазряда</name>
  <registerRecords>InformationRegister.ПодтвержденныеРазрядыСпортсменов</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Спортсмен</name>
    <type>
      <types>CatalogRef.Спортсмены</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПрисвоения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Разряд</name>
    <type>
      <types>CatalogRef.СпортивнаяКлассификация</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодтверждающийДокумент</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПодтверждающегоДокумента</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПодтверждающегоДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидСпорта</name>
    <type>
      <types>CatalogRef.ВидыСпорта</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПодтверждения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияПрисвоившаяРазряд</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КраткийСоставСпортсмены</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Основания</name>
    <attributes>
      <name>Соревнование</name>
      <type>
        <types>DocumentRef.Соревнование</types>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дисциплина</name>
      <type>
        <types>CatalogRef.СпортивныеДисциплины</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Место</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Спортсмены</name>
    <attributes>
      <name>Спортсмен</name>
      <type>
        <types>CatalogRef.Спортсмены</types>
      </type>
    </attributes>
    <attributes>
      <name>Соревнование</name>
      <type>
        <types>DocumentRef.Соревнование</types>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дисциплина</name>
      <type>
        <types>CatalogRef.СпортивныеДисциплины</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Место</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Разряд</name>
      <type>
        <types>CatalogRef.СпортивнаяКлассификация</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПрисвоения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаПодтверждения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИС_СПОРТ_2022/src/Catalogs/Спортсмены/Спортсмены.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Спортсмены</name>
  <attributes>
    <name>ФизическоеЛицо</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Фото</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусСпортсмена</name>
    <type>
      <types>EnumRef.СтатусыСпортсменов</types>
    </type>
  </attributes>
  <attributes>
    <name>РайонДиспансеризации</name>
    <type>
      <types>CatalogRef.Районы</types>
    </type>
  </attributes>
  <attributes>
    <name>СовпадаетАдрес</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОсобенностиЗдоровья</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмеетсяИнвалидностьПоОбщемуЗаболеванию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмеютсяИнтеллектуальныеНарушения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмеетсяНарушениеЗрения</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмеетсяНарушениеСлуха</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИмеетсяНарушениеОДА</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПФЗ</name>
    <attributes>
      <name>УникальныйИдентификаторСтрокиПоказателя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ГодОбучения</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.ПоказателиФизическогоЗдоровья</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ИС_СПОРТ_2022/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ФизическиеЛица</name>
  <attributes>
    <name>ДатаРождения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Пол</name>
    <type>
      <types>EnumRef.ПолФизическогоЛица</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Фото</name>
    <type>
      <types>CatalogRef.Файлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФамилияЛатиница</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяЛатиница</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтчествоЛатиница</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ГодРождения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>4</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СНИЛС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НомерПолисаОМС</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>16</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <attributes>
      <name>Тип</name>
      <type>
        <types>EnumRef.ТипыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Вид</name>
      <type>
        <types>CatalogRef.ВидыКонтактнойИнформации</types>
      </type>
    </attributes>
    <attributes>
      <name>Представление</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Страна</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Регион</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Город</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ИС_СПОРТ_2022/src/Documents/ПрисвоениеРазряда/ObjectModule.bsl
// {Рарус adilas #1.0.0.2 -Исправления по SonarQube 2021.04.23
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
		
	Если ОбменДанными.Загрузка Тогда
         Возврат;
    КонецЕсли;
	
	ПроведениеСервер.УстановитьРежимПроведения(ЭтотОбъект, РежимЗаписи, РежимПроведения);
	
	УчетСпортсменовСервер.ЗаполнитьРеквизит(ЭтотОбъект, "Ответственный", ПараметрыСеанса.ТекущийПользователь);
    
    ПараметрыОписанияКраткогоСостава = СформироватьПараметрыПостроенияСтроки();
    СтрокаОписаниКраткогоСостава = УчетСпортсменовСервер.СформироватьСтрокуПоМассиву(ПараметрыОписанияКраткогоСостава);
    
    УчетСпортсменовСервер.ЗаполнитьРеквизит(ЭтотОбъект, "КраткийСоставСпортсмены", СтрокаОписаниКраткогоСостава);
    
    // {Рарус kotana #10067 -Контроль возраста спортсмена 2020.10.28
    
    //Запрос = Новый Запрос;              
    //	
    //Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДата());		
    //Запрос.УстановитьПараметр("Ссылка", Ссылка);
    //Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
    //               |	ПрисвоениеРазрядаСпортсмены.Спортсмен КАК Спортсмен,
    //               |	ПрисвоениеРазрядаСпортсмены.Разряд КАК Разряд
    //               |ПОМЕСТИТЬ ВТ_СпортсменРазряд
    //               |ИЗ
    //               |	Документ.ПрисвоениеРазряда.Спортсмены КАК ПрисвоениеРазрядаСпортсмены
    //               |ГДЕ
    //               |	ПрисвоениеРазрядаСпортсмены.Ссылка = &Ссылка
    //               |;
    //               |
    //               |////////////////////////////////////////////////////////////////////////////////
    //               |ВЫБРАТЬ
    //               |	РАЗНОСТЬДАТ(ФизическиеЛица.ДатаРождения, &ТекущаяДата, ГОД) КАК Возраст,
    //               |	СпортивнаяКлассификация.МинимальныйВозраст КАК МинимальныйВозраст,
    //               |	ВТ_СпортсменРазряд.Спортсмен КАК Спортсмен,
    //               |	СпортивнаяКлассификация.Ссылка КАК Разряд
    //               |ПОМЕСТИТЬ ВТ_РасчетВозраста
    //               |ИЗ
    //               |	ВТ_СпортсменРазряд КАК ВТ_СпортсменРазряд
    //               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпортивнаяКлассификация КАК СпортивнаяКлассификация
    //               |		ПО ВТ_СпортсменРазряд.Разряд = СпортивнаяКлассификация.Ссылка
    //               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Спортсмены КАК Спортсмены
    //               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
    //               |			ПО Спортсмены.ФизическоеЛицо = ФизическиеЛица.Ссылка
    //               |		ПО ВТ_СпортсменРазряд.Спортсмен = Спортсмены.Ссылка
    //               |;
    //               |
    //               |////////////////////////////////////////////////////////////////////////////////
    //               |ВЫБРАТЬ
    //               |	ВТ_РасчетВозраста.Спортсмен КАК Спортсмен,
    //               |	ВТ_РасчетВозраста.МинимальныйВозраст КАК МинимальныйВозраст,
    //               |	ВТ_РасчетВозраста.Возраст КАК Возраст,
    //               |	ВТ_РасчетВозраста.Разряд КАК Разряд
    //               |ИЗ
    //               |	ВТ_РасчетВозраста КАК ВТ_РасчетВозраста
    //               |ГДЕ
    //               |	ВЫБОР
    //               |			КОГДА ЕСТЬNULL(ВТ_РасчетВозраста.МинимальныйВозраст, 0) > 0
    //               |				ТОГДА ВТ_РасчетВозраста.МинимальныйВозраст > ВТ_РасчетВозраста.Возраст
    //               |			ИНАЧЕ ЛОЖЬ
    //               |		КОНЕЦ";
    //              
    //                
    //РезультатЗапроса = Запрос.Выполнить();
    //
    //Если НЕ РезультатЗапроса.Пустой() Тогда
    //	
    //	Отказ = Истина;
    //	
    //	Выборка = РезультатЗапроса.Выбрать();
    //	Пока Выборка.Следующий() Цикл
    //		ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
    //		НСтр("ru = 'Минимальный возраст присвоения разряда (звания) %1 лет.
    //		|Возраст спортсмена %2 - %3 лет.'"),
    //		Выборка.МинимальныйВозраст,
    //		Выборка.Спортсмен,
    //		Выборка.Возраст);
    //		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
    //	КонецЦикла;
    //	
    //КонецЕсли;
    //
    //Если Отказ Тогда
    //	Возврат
    //КонецЕсли;	
    
    // }Рарус kotana #10067 -Контроль возраста спортсмена 2020.10.28
    
	ДополнительныеСвойства.Вставить("ЭтоНовый",    ЭтоНовый());
	ДополнительныеСвойства.Вставить("РежимЗаписи", РежимЗаписи);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
    
    // {Рарус kotana #10067 -Контроль возраста спортсмена 2020.10.28

    ПроверитьВозрастСпортсменов(Отказ);
    
    Если НЕ Отказ Тогда
    // }Рарус kotana #10067 -Контроль возраста спортсмена 2020.10.28
    
        ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства, РежимПроведения);
        
        ПроведениеСервер.ИнициализироватьДанныеДокумента(Ссылка, ДополнительныеСвойства);
        
        ПроведениеСервер.ОтразитьДвижения(ДополнительныеСвойства, Движения, Отказ, "ПодтвержденныеРазрядыСпортсменов");
        
        Движения.Записать();
        
        ПроведениеСервер.ВыполнитьКонтрольРезультатовПроведения(ЭтотОбъект, Отказ);
        
        ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
        
    // {Рарус kotana #10067 -Контроль возраста спортсмена 2020.10.28
    КонецЕсли; 

    // }Рарус kotana #10067 -Контроль возраста спортсмена 2020.10.28
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	ПроведениеСервер.ИнициализироватьДополнительныеСвойстваДляПроведения(Ссылка, ДополнительныеСвойства);

	ПроведениеСервер.ПодготовитьНаборыЗаписейКРегистрацииДвижений(ЭтотОбъект);

	Движения.Записать();

	ПроведениеСервер.ВыполнитьКонтрольРезультатовОтменыПроведения(ЭтотОбъект, Отказ);

	ПроведениеСервер.ОчиститьДополнительныеСвойстваДляПроведения(ДополнительныеСвойства);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// {Рарус kotana #10067 -Контроль возраста спортсмена 2020.10.28
Процедура ПроверитьВозрастСпортсменов(Отказ)

	Запрос = Новый Запрос;              
		
	Запрос.УстановитьПараметр("ТекущаяДата", ТекущаяДатаСеанса());		
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	ПрисвоениеРазрядаСпортсмены.Спортсмен КАК Спортсмен,
	               |	ПрисвоениеРазрядаСпортсмены.Разряд КАК Разряд
	               |ПОМЕСТИТЬ ВТ_СпортсменРазряд
	               |ИЗ
	               |	Документ.ПрисвоениеРазряда.Спортсмены КАК ПрисвоениеРазрядаСпортсмены
	               |ГДЕ
	               |	ПрисвоениеРазрядаСпортсмены.Ссылка = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	РАЗНОСТЬДАТ(ФизическиеЛица.ДатаРождения, &ТекущаяДата, ГОД) КАК Возраст,
	               |	СпортивнаяКлассификация.МинимальныйВозраст КАК МинимальныйВозраст,
	               |	ВТ_СпортсменРазряд.Спортсмен КАК Спортсмен,
	               |	СпортивнаяКлассификация.Ссылка КАК Разряд
	               |ПОМЕСТИТЬ ВТ_РасчетВозраста
	               |ИЗ
	               |	ВТ_СпортсменРазряд КАК ВТ_СпортсменРазряд
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СпортивнаяКлассификация КАК СпортивнаяКлассификация
	               |		ПО ВТ_СпортсменРазряд.Разряд = СпортивнаяКлассификация.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Спортсмены КАК Спортсмены
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ФизическиеЛица КАК ФизическиеЛица
	               |			ПО Спортсмены.ФизическоеЛицо = ФизическиеЛица.Ссылка
	               |		ПО ВТ_СпортсменРазряд.Спортсмен = Спортсмены.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_РасчетВозраста.Спортсмен КАК Спортсмен,
	               |	ВТ_РасчетВозраста.МинимальныйВозраст КАК МинимальныйВозраст,
	               |	ВТ_РасчетВозраста.Возраст КАК Возраст,
	               |	ВТ_РасчетВозраста.Разряд КАК Разряд
	               |ИЗ
	               |	ВТ_РасчетВозраста КАК ВТ_РасчетВозраста
	               |ГДЕ
	               |	ВЫБОР
	               |			КОГДА ЕСТЬNULL(ВТ_РасчетВозраста.МинимальныйВозраст, 0) > 0
	               |				ТОГДА ВТ_РасчетВозраста.МинимальныйВозраст > ВТ_РасчетВозраста.Возраст
	               |			ИНАЧЕ ЛОЖЬ
	               |		КОНЕЦ";
	              
	                
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		
		Отказ = Истина;
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			НСтр("ru = 'Минимальный возраст присвоения разряда (звания) %1 лет.
			|Возраст спортсмена %2 - %3 лет.'"),
			Выборка.МинимальныйВозраст,
			Выборка.Спортсмен,
			Выборка.Возраст);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		КонецЦикла;
		
	КонецЕсли;	

КонецПроцедуры // ПроверитьВозрастСпортсменов()

Функция СформироватьПараметрыПостроенияСтроки()

	   ТЗСпортсменов = Спортсмены.Выгрузить();
       ТЗСпортсменов.Свернуть("Спортсмен");
       ТЗСпортсменов.Сортировать("Спортсмен");
       
       СтруктураПараметров = Новый Структура;
       СтруктураПараметров.Вставить("МассивЗначений",ТЗСпортсменов.ВыгрузитьКолонку("Спортсмен"));
       СтруктураПараметров.Вставить("ОграниченнаяДлина",Истина);
       СтруктураПараметров.Вставить("ДлинаСтроки",1000);

       Возврат СтруктураПараметров;
       
КонецФункции
 
// }Рарус kotana #10067 -Контроль возраста спортсмена 2020.10.28

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
